In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates=pd.date_range('20130101',periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  0.225309 -2.898186 -1.113616 -0.475244
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-03  0.173387 -0.452030  0.711403 -0.504068
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-05  1.209674 -0.537148  0.197319  0.213763
2013-01-06  0.967341  1.051879  0.070666  0.371819

In [9]:
df2=pd.DataFrame({'A':1.,
                 'B': pd.Timestamp('20130102'),
                 'C': pd.Series(1,index=list(range(4)),dtype='float32'),
                 'D': np.array([3]*4,dtype='int32'),
                 'E': pd.Categorical(["test","train","test","train"]),
                 'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [22]:
df2.A              
df2.any
df2.add            
df2.append
df2.add_prefix     
df2.apply
df2.add_suffix     
df2.applymap
df2.agg            
df2.as_matrix
df2.aggregate      
df2.asfreq
df2.align

<bound method DataFrame.align of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [23]:
df.head()

                   A         B         C         D
2013-01-01  0.225309 -2.898186 -1.113616 -0.475244
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-03  0.173387 -0.452030  0.711403 -0.504068
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-05  1.209674 -0.537148  0.197319  0.213763

In [24]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-05  1.209674 -0.537148  0.197319  0.213763
2013-01-06  0.967341  1.051879  0.070666  0.371819

In [25]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df.to_numpy()

array([[ 0.22530889, -2.89818647, -1.11361627, -0.47524427],
       [ 0.05466394, -1.07001624, -1.3689095 , -1.17401845],
       [ 0.17338699, -0.45203015,  0.71140315, -0.50406819],
       [ 1.03755127,  1.51411039,  0.68535476,  0.8508946 ],
       [ 1.20967385, -0.53714757,  0.19731892,  0.2137631 ],
       [ 0.96734091,  1.0518793 ,  0.07066637,  0.3718191 ]])

In [28]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [29]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.611321 -0.398565 -0.136297 -0.119476
std    0.513246  1.580072  0.896920  0.732199
min    0.054664 -2.898186 -1.368909 -1.174018
25%    0.186367 -0.936799 -0.817546 -0.496862
50%    0.596325 -0.494589  0.133993 -0.130741
75%    1.019999  0.675902  0.563346  0.332305
max    1.209674  1.514110  0.711403  0.850895

In [30]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.225309    0.054664    0.173387    1.037551    1.209674    0.967341
B   -2.898186   -1.070016   -0.452030    1.514110   -0.537148    1.051879
C   -1.113616   -1.368909    0.711403    0.685355    0.197319    0.070666
D   -0.475244   -1.174018   -0.504068    0.850895    0.213763    0.371819

In [31]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.475244 -1.113616 -2.898186  0.225309
2013-01-02 -1.174018 -1.368909 -1.070016  0.054664
2013-01-03 -0.504068  0.711403 -0.452030  0.173387
2013-01-04  0.850895  0.685355  1.514110  1.037551
2013-01-05  0.213763  0.197319 -0.537148  1.209674
2013-01-06  0.371819  0.070666  1.051879  0.967341

In [34]:
df.sort_values('B',ascending=False)

                   A         B         C         D
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-06  0.967341  1.051879  0.070666  0.371819
2013-01-03  0.173387 -0.452030  0.711403 -0.504068
2013-01-05  1.209674 -0.537148  0.197319  0.213763
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-01  0.225309 -2.898186 -1.113616 -0.475244

In [35]:
df['A']

2013-01-01    0.225309
2013-01-02    0.054664
2013-01-03    0.173387
2013-01-04    1.037551
2013-01-05    1.209674
2013-01-06    0.967341
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01  0.225309 -2.898186 -1.113616 -0.475244
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-03  0.173387 -0.452030  0.711403 -0.504068

In [37]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-03  0.173387 -0.452030  0.711403 -0.504068
2013-01-04  1.037551  1.514110  0.685355  0.850895

In [38]:
df.loc[dates[0]]

A    0.225309
B   -2.898186
C   -1.113616
D   -0.475244
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.225309 -2.898186
2013-01-02  0.054664 -1.070016
2013-01-03  0.173387 -0.452030
2013-01-04  1.037551  1.514110
2013-01-05  1.209674 -0.537148
2013-01-06  0.967341  1.051879

In [40]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.054664 -1.070016
2013-01-03  0.173387 -0.452030
2013-01-04  1.037551  1.514110

In [41]:
df.loc['20130102',['A','B']]

A    0.054664
B   -1.070016
Name: 2013-01-02 00:00:00, dtype: float64

In [42]:
df.loc[dates[0],'A']

0.22530888957598164

In [43]:
df.at[dates[0],'A']

0.22530888957598164

In [44]:
df.iloc[3]

A    1.037551
B    1.514110
C    0.685355
D    0.850895
Name: 2013-01-04 00:00:00, dtype: float64

In [45]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.037551  1.514110
2013-01-05  1.209674 -0.537148

In [46]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.054664 -1.368909
2013-01-03  0.173387  0.711403
2013-01-05  1.209674  0.197319

In [47]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018
2013-01-03  0.173387 -0.452030  0.711403 -0.504068

In [51]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -2.898186 -1.113616
2013-01-02 -1.070016 -1.368909
2013-01-03 -0.452030  0.711403
2013-01-04  1.514110  0.685355
2013-01-05 -0.537148  0.197319
2013-01-06  1.051879  0.070666

In [52]:
df.loc[:, 'B':'C']

                   B         C
2013-01-01 -2.898186 -1.113616
2013-01-02 -1.070016 -1.368909
2013-01-03 -0.452030  0.711403
2013-01-04  1.514110  0.685355
2013-01-05 -0.537148  0.197319
2013-01-06  1.051879  0.070666

In [49]:
df.iloc[1,1]

-1.070016236550684

In [50]:
df.iat[1,1]

-1.070016236550684

In [54]:
df[df.B>0]

                   A         B         C         D
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-06  0.967341  1.051879  0.070666  0.371819

In [55]:
df[df>0]

                   A         B         C         D
2013-01-01  0.225309       NaN       NaN       NaN
2013-01-02  0.054664       NaN       NaN       NaN
2013-01-03  0.173387       NaN  0.711403       NaN
2013-01-04  1.037551  1.514110  0.685355  0.850895
2013-01-05  1.209674       NaN  0.197319  0.213763
2013-01-06  0.967341  1.051879  0.070666  0.371819

In [56]:
df2=df.copy()

In [57]:
df2['E']=['one','one','two','three','four','three']

In [58]:
df2

                   A         B         C         D      E
2013-01-01  0.225309 -2.898186 -1.113616 -0.475244    one
2013-01-02  0.054664 -1.070016 -1.368909 -1.174018    one
2013-01-03  0.173387 -0.452030  0.711403 -0.504068    two
2013-01-04  1.037551  1.514110  0.685355  0.850895  three
2013-01-05  1.209674 -0.537148  0.197319  0.213763   four
2013-01-06  0.967341  1.051879  0.070666  0.371819  three

In [59]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.173387 -0.452030  0.711403 -0.504068   two
2013-01-05  1.209674 -0.537148  0.197319  0.213763  four